let handler = async (m, { conn, usedPrefix, command}) => {
let who = m.quoted ? m.quoted.sender : m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
if (!(who in global.db.data.users)) throw `❌ The User Is Not Found In My Database`
let pp = './ANNA.jpg'
let more = String.fromCharCode(8206)
let readMore = more.repeat(850) 
let lkr = `
  ✦ ───『 *ɢʀᴏᴜᴘ* 』─── ⚝
  ◈ .ɢᴇᴛʙɪᴏ <@ᴛᴀɢ/ʀᴇᴘʟʏ>  Ⓛ
  ◈ .ᴀɴɪᴍᴇϙᴜᴏᴛᴇ
  ◈ .Sᴇᴛᴅᴇsᴄ <ᴛᴇxᴛ>
  ◈ .sᴇᴛɴᴀᴍᴇ <ᴛᴇxᴛ>
  ◈ .ᴀᴅᴅ
  ◈ .ᴅᴇʟᴇᴛᴇ
  ◈ .ᴅᴇʟᴡᴀʀɴ @ᴜsᴇʀ
  ◈ .ᴅᴇᴍᴏᴛᴇ (@ᴛᴀɢ)
  ◈ .ɪɴғᴏɢᴘ
  ◈ .ʜɪᴅᴇᴛᴀɢ
  ◈ .ɪɴᴠɪᴛᴇ <241xxx>
  ◈ .ᴋɪᴄᴋ @ᴜsᴇʀ
  ◈ .ʟɪɴᴋ
  ◈ .ᴘᴏʟʟ ϙᴜᴇsᴛɪᴏɴ|ᴏᴘᴛɪᴏɴ|ᴏᴘᴛɪᴏɴ
  ◈ .ᴘʀᴏғɪʟᴇ
  ◈ .ᴘʀᴏᴍᴏᴛᴇ
  ◈ .ʀᴇsᴇᴛʟɪɴᴋ
  ◈ .sᴇᴛʙʏᴇ <ᴛᴇxᴛ>
  ◈ .ɢʀᴏᴜᴘ *ᴏᴘᴇɴ/ᴄʟᴏsᴇ*
  ◈ .sᴇᴛᴡᴇʟᴄᴏᴍᴇ <ᴛᴇxᴛ>
  ◈ .sɪᴍᴜʟᴀᴛᴇ <ᴇᴠᴇɴᴛ> @ᴜsᴇʀ
  ◈ .sᴛᴀғғ
  ◈ .ᴛᴀɢᴀʟʟ
  ◈ .ᴛᴏᴛᴀɢ
  ◈ .ᴡᴀʀɴ @ᴜsᴇʀ
  ◈ .ᴡᴀʀɴs
  ◈ .ᴍᴀɪɴ
  ╰──────────⳹
  
  ✦ ───『 *ᴏᴡɴᴇʀ* 』─── ⚝
  ◈ .ᴀᴅᴅᴘʀᴇᴍ <@ᴛᴀɢ>
  ◈ .ᴀᴅᴅᴏᴡɴᴇʀ @ᴜsᴇʀ
  ◈ .ᴀʟʟᴏᴡ <@ᴛᴀɢ>
  ◈ .HEROKU
  ◈ .ʙᴀɴ @ᴜsᴇʀ
  ◈ .ʙᴀɴᴄʜᴀᴛ
  ◈ .ᴛx
  ◈ .ʙʀᴏᴀᴅᴄᴀsᴛɢʀᴏᴜᴘ <ᴛᴇxᴛ>
  ◈ .ʙᴄɢᴄ <ᴛᴇxᴛ>
  ◈ .ᴄʟᴇᴀʀᴛᴍᴘ
  ◈ .ᴅᴇʟᴇxᴘɪʀᴇᴅ
  ◈ .ᴅᴇʟᴘʀᴇᴍ @ᴜsᴇʀ
  ◈ .ʀᴇᴍᴏᴠᴇᴏᴡɴᴇʀ @ᴜsᴇʀ
  ◈ .sᴇᴛᴘᴘʙᴏᴛғᴜʟʟ
  ◈ .ɢᴇᴛᴘʟᴜɢɪɴ <ɴᴀᴍᴇ ғɪʟᴇ>
  ◈ .ɢᴇᴛғɪʟᴇ <ɴᴀᴍᴇ ғɪʟᴇ>
  ◈ .ᴊᴏɪɴ <ᴄʜᴀᴛ.ᴡʜᴀᴛsᴀᴘᴘ.ᴄᴏᴍ> <ᴅɪᴀs>
  ◈ .ʀᴇsᴇᴛ <54xxx>
  ◈ .ʀᴇsᴇᴛᴘʀᴇғɪx
  ◈ .ʀᴇsᴛᴀʀᴛ
  ◈ ..sᴇᴛᴘʀᴇғɪx
  ◈ ..sᴇᴛᴘʀᴇғɪx [sʏᴍʙᴏʟ]
  ◈ .ᴜɴʙᴀɴ @ᴜsᴇʀ
  ◈ .ᴜɴʙᴀɴᴄʜᴀᴛ
  ◈ .ᴜᴘᴅᴀᴛᴇ
  ◈ .ᴄᴏɴғɪɢ
  ◈ .ʟɪsᴛʙᴀɴ
  ◈ .ᴅᴇʟᴇᴛᴇᴘʟᴜɢɪɴ <ɴᴀᴍᴇ>
  ╰──────────⳹
  
  
  ✦ ───『 *ғᴜɴ* 』─── ⚝
  ◈ .ᴀғᴋ <ʀᴇᴀsᴏɴ>
  ◈ .ᴛᴏᴍᴘ3
  ◈ .ᴛᴏᴀᴠ
  ◈ .ʙᴏᴛ
  ◈ .ᴄʜᴀʀᴀᴄᴛᴇʀ @ᴛᴀɢ
  ◈ .ᴅᴀʀᴇ
  ◈ .ғʟɪʀᴛ
  ◈ .ɢᴀʏ @ᴜsᴇʀ
  ◈ .ᴘɪᴄᴋᴜᴘʟɪɴᴇ
  ◈ .ϙᴜᴇsᴛɪᴏɴ
  ◈ .sʜᴀʏᴀʀɪ
  ◈ .sʜɪᴘ
  ◈ .ʏᴏᴍᴀᴍᴀᴊᴏᴋᴇ
  ◈ .ᴛʀᴜᴛʜ
  ◈ .ᴡᴀsᴛᴇ @ᴜsᴇʀ
  ◈ .ɪᴍᴀɢᴇ
  ◈ .ᴍᴇᴍᴇ
  ◈ .ϙᴜᴏᴛᴇ
  ╰──────────⳹

                  
  ✦ ───『 *ʀᴇᴀᴄᴛɪᴏɴ* 』─── ⚝
  ◈ .ʙᴜʟʟʏ @ᴛᴀɢ
  ◈ .ᴄᴜᴅᴅʟᴇ @ᴛᴀɢ
  ◈ .ᴄʀʏ @ᴛᴀɢ
  ◈ .ʜᴜɢ @ᴛᴀɢ
  ◈ .ᴀᴡᴏᴏ @ᴛᴀɢ
  ◈ .ᴋɪss @ᴛᴀɢ
  ◈ .ʟɪᴄᴋ @ᴛᴀɢ
  ◈ .ᴘᴀᴛ @ᴛᴀɢ
  ◈ .sᴍᴜɢ @ᴛᴀɢ
  ◈ .ʙᴏɴᴋ @ᴛᴀɢ
  ◈ .ʏᴇᴇᴛ @ᴛᴀɢ
  ◈ .ʙʟᴜsʜ @ᴛᴀɢ
  ◈ .sᴍɪʟᴇ @ᴛᴀɢ
  ◈ .ᴡᴀᴠᴇ @ᴛᴀɢ
  ◈ .ʜɪɢʜғɪᴠᴇ @ᴛᴀɢ
  ◈ .ʜᴀɴᴅʜᴏʟᴅ @ᴛᴀɢ
  ◈ .ɴᴏᴍ @ᴛᴀɢ
  ◈ .ʙɪᴛᴇ @ᴛᴀɢ
  ◈ .ɢʟᴏᴍᴘ @ᴛᴀɢ
  ◈ .sʟᴀᴘ @ᴛᴀɢ
  ◈ .ᴋɪʟʟ @ᴛᴀɢ
  ◈ .ʜᴀᴘᴘʏ @ᴛᴀɢ
  ◈ .ᴡɪɴᴋ @ᴛᴀɢ
  ◈ .ᴘᴏᴋᴇ @ᴛᴀɢ
  ◈ .ᴅᴀɴᴄᴇ @ᴛᴀɢ
  ◈ .ᴄʀɪɴɢᴇ @ᴛᴀɢ
  ╰──────────⳹
  
 
  ✦ ───『 *ᴅᴏᴡɴʟᴏᴀᴅᴇʀ* 』───✫
  │◈ .ғᴀᴄᴇʙᴏᴏᴋ <ᴜʀʟ>
  │◈ .ɢᴅʀɪᴠᴇ <ᴜʀʟ>
  │◈ .ɢɪᴛᴄʟᴏɴᴇ <ᴜʀʟ>
  │◈ .ɪɢsᴛᴀʟᴋ
  │◈ .ɪɴsᴛᴀɢʀᴀᴍ
  │◈ .ᴍᴇᴅɪᴀғɪʀᴇ <ᴜʀʟ>
  │◈ .ᴍᴇɢᴀ
  │◈ .ᴍᴏᴅᴀᴘᴋ
  │◈ .ᴘʟᴀʏ <ϙᴜᴇʀʏ>
  │◈ .ᴘʟᴀʏʏ <ᴛᴇxᴛ>
  │◈ .ᴠɪᴅᴇᴏ <ᴛᴇxᴛ>
  │◈ .ᴛɪᴋᴛᴏᴋ <ᴜʀʟ>
  │◈ .ᴛɪᴋᴛᴏᴋsᴛᴀʟᴋ
  │◈ .ᴛᴡɪᴛᴛᴇʀ <ᴜʀʟ>
  │◈ .ʏᴛᴀ <ᴜʀʟ>
  │◈ .ʏᴛᴅʟ <ᴜʀʟ>
  │◈ .ʏᴛᴠ <ᴜʀʟ>
  │◈ .ʏᴛᴍᴘ3 <ᴜʀʟ>
  │◈ .ʏᴛsᴇᴀʀᴄʜ <ϙᴜᴇʀʏ>
  │◈ .ʏᴛᴍᴘ4 <ʏᴛ-ʟɪɴᴋ>
  │◈ .ᴡᴀʟʟᴘᴀᴘᴇʀ <ϙᴜᴇʀʏ>
  ╰━━━━━━━━━━━━━━━━━━━━╯
  
  
  ✦ ───『 *ɢᴀᴍᴇ* 』─── ⚝
  ◈ .sʟᴏᴛ <ᴀᴍᴏᴜɴᴛ>
  ◈ .ᴄʜᴇss [ғʀᴏᴍ ᴛᴏ]
  ◈ .ᴄʜᴇss ᴅᴇʟᴇᴛᴇ
  ◈ .ᴄʜᴇss ᴊᴏɪɴ
  ◈ .ᴄʜᴇss sᴛᴀʀᴛ
  ◈ .ᴅᴇʟᴛᴛᴛ
  ◈ .ɢᴜᴇssғʟᴀɢ
  ◈ .Mᴀᴛʜs <ᴍᴏᴅᴇs>
  ◈ .ᴘᴘᴛ <ʀᴏᴄᴋ/ᴘᴀᴘᴇʀ/sᴄɪssᴏʀs>
  ◈ .ᴛɪᴄᴛᴀᴄᴛᴏᴇ <ᴛᴀɢ ɴᴜᴍʙᴇʀ>
  ╰──────────⳹

  
  ✦ ───『 *ᴍᴀᴋᴇʀ* 』─── ⚝
  ◈ .ʙʟᴜʀ
  ◈ .ᴅɪғᴜᴍɪɴᴀʀ2
  ◈ .ʜᴏʀɴʏᴄᴀʀᴅ
  ◈ .ʜᴏʀɴʏʟɪᴄᴇɴsᴇ
  ◈ .ɢғx1
  ◈ .ɢғx2
  ◈ .ɢғx3
  ◈ .ɢғx4
  ◈ .ɢғx5
  ◈ .ɢғx6
  ◈ .ɢғx7
  ◈ .ɢғx8
  ◈ .ɢғx9
  ◈ .ɢғx10
  ◈ .ɢғx11
  ◈ .ɢғx12
  ◈ .sɪᴍᴘᴄᴀʀᴅ
  ◈ .ɪᴛssᴏsᴛᴜᴘɪᴅ
  ◈ .ɪss
  ◈ .sᴛᴜᴘɪᴅ
  ◈ .ᴛᴡᴇᴇᴛ <ᴄᴏᴍᴍᴇɴᴛ>
  ◈ .ʟᴏʟɪᴄᴏɴ
  ◈ .ʏᴛᴄᴏᴍᴍᴇɴᴛ <ᴄᴏᴍᴍᴇɴᴛ>
  ╰──────────⳹
  
  ✦ ───『 *sᴛɪᴄᴋᴇʀ* 』─── ✦
  ◈ .ᴇᴍᴏᴊɪᴍɪx <ᴇᴍᴏᴊɪ+ᴇᴍᴏᴊɪ>
  ◈ .ɢᴇᴛsᴛɪᴄᴋᴇʀ
  ◈ .sᴍᴀᴋᴇʀ
  ◈ .sᴛɪᴄᴋᴇʀᴡɪᴛʜᴍᴇᴍᴇ (ᴄᴀᴘᴛɪᴏɴ|ʀᴇᴘʟʏ ᴍᴇᴅɪᴀ)
  ◈ .sᴡᴍᴇᴍᴇ <ᴜʀʟ>
  ◈ .sᴡᴍ(ᴄᴀᴘᴛɪᴏɴ|ʀᴇᴘʟʏ ᴍᴇᴅɪᴀ)
  ◈ .sғᴜʟʟ
  ◈ .ᴛᴏɪᴍɢ <sᴛɪᴄᴋᴇʀ>
  ◈ .ᴛᴏᴠɪᴅ
  ◈ .ᴛʀɪɢɢᴇʀ <@ᴜsᴇʀ>
  ◈ .ᴛᴛᴘ
  ◈ .ᴛᴛᴘ2
  ◈ .ᴛᴛᴘ3
  ◈ .ᴛᴛᴘ4
  ◈ .ᴛᴛᴘ5
  ◈ .ᴀᴛᴛᴘ
  ◈ .ᴀᴛᴛᴘ2
  ◈ .ᴀᴛᴛᴘ3
  ◈ .ᴛᴀᴋᴇ <ɴᴀᴍᴇ>|<ᴀᴜᴛʜᴏʀ>
  ╰──────────⳹

 
  ✦ ───『 *ᴀᴜᴅɪᴏ* 』─── ✦
  ◈ .ʙᴀss [ᴠɴ]
  ◈ .ʙʟᴏᴡɴ [ᴠɴ]
  ◈ .ᴅᴇᴇᴘ [ᴠɴ]
  ◈ .ᴇᴀʀʀᴀᴘᴇ [ᴠɴ]
  ◈ .ғᴀsᴛ [ᴠɴ]
  ◈ .ғᴀᴛ [ᴠɴ]
  ◈ .ɴɪɢʜᴛᴄᴏʀᴇ [ᴠɴ]
  ◈ .ʀᴇᴠᴇʀsᴇ [ᴠɴ]
  ◈ .ʀᴏʙᴏᴛ [ᴠɴ]
  ◈ .sʟᴏᴡ [ᴠɴ]
  ◈ .sᴍᴏᴏᴛʜ [ᴠɴ]
  ◈ .ᴛᴜᴘᴀɪ [ᴠɴ]
  ╰──────────⳹
  
  
  ✦ ───『 *ɴᴇᴡs* 』─── ⚝
  ◈ .ɴᴇᴡs
  ◈ .ᴛᴇᴄʜɴᴇᴡs
  ◈ .ɴᴅᴛᴠ
  ╰──────────⳹
  
  
  ✦ ───『 *ᴛᴏᴏʟs* 』─── ✦
  ◈ .ɴᴏᴡᴀ
  ◈ .ϙʀ <ᴛᴇxᴛ>
  ◈ .ϙʀᴄᴏᴅᴇ <ᴛᴇxᴛ>
  ◈ .sᴛʏʟᴇ <ᴋᴇʏ> <ᴛᴇxᴛ>
  ◈ .ᴡᴇᴀᴛʜᴇʀ *<ᴘʟᴀᴄᴇ>*
  ◈ .ᴅᴇʜᴀᴢᴇ
  ◈ .ʀᴇᴄᴏʟᴏʀ
  ◈ .ʜᴅʀ
  ◈ .ʟᴇɴɢᴛʜ <ᴀᴍᴏᴜɴᴛ>
  ◈ .ᴛɪɴʏᴜʀʟ <ʟɪɴᴋ>
  ◈ .sʜᴏʀᴛᴇɴ <ʟɪɴᴋ>
  ◈ .ᴛᴇᴍᴘᴍᴀɪʟ
  ◈ .sʜᴀᴢᴀᴍ
  ◈ .ᴄᴀʟ <ᴇϙᴜᴀᴛɪᴏɴ>
  ◈ .ᴄᴀʀʙᴏɴ <ᴄᴏᴅᴇ>
  ◈ .ᴅᴇғɪɴᴇ <ᴡᴏʀᴅ>
  ◈ .ᴇʟᴇᴍᴇɴᴛ
  ◈ .ɢᴏᴏɢʟᴇ
  ◈ .ɪᴛᴜɴᴇs
  ◈ .ʟʏʀɪᴄs
  ◈ .ɪᴍᴅʙ
  ◈ .ᴄᴏᴜʀsᴇ
  ◈ .ʀᴀɴᴅᴏᴍᴄᴏᴜʀsᴇ
  ◈ .ʀᴇᴀᴅᴍᴏʀᴇ <ᴛᴇxᴛ1>|<ᴛᴇxᴛ2>
  ◈ .ʀᴇᴀᴅᴠᴏ
  ◈ .ʀᴇᴍᴏᴠᴇʙɢ
  ◈ .ss <ᴜʀʟ>
  ◈ .ssғ <ᴜʀʟ>
  ◈ .sᴜʙʀᴇᴅᴅɪᴛ
  ◈ .ᴛᴇʟᴇsᴛɪᴄᴋᴇʀ  Ⓛ
  ◈ .ᴛᴏᴜʀʟ
  ◈ .ᴛʀᴀɴsʟᴀᴛᴇ <ʟᴀɴɢ> <ᴛᴇxᴛ>
  ◈ .ᴛʀᴜᴇ
  ◈ .ᴛᴛs <ʟᴀɴɢ> <ᴛᴀsᴋ>
  ◈ .ᴡᴀ
  ◈ .ᴡɪᴋɪᴘᴇᴅɪᴀ
  ╰━━━━━━━━━━━━━━━━━━━━╯

  
  ◈ ───『 *AI* 』─── ◈
  ◈ .ʙɪɴɢ
  ◈ .ᴅᴀʟʟᴇ
  ◈ .ɢᴘᴛ
  ◈ .ᴛᴏᴀɴɪᴍᴇ
  ◈ .ᴛᴏᴄᴀʀᴛᴏᴏɴ
  ◈ .ᴀɪ
  ◈ .ʙᴀʀᴅ
  ◈ .ᴀʟᴇxᴀ
  ◈ .ɢᴘᴛ2
  ╰━━━━━━━━━━━━━━━━╯
  
  
  ✦ ───『 *ʀᴇʟɪɢɪᴏɴ* 』─── ⚝
  ◈ .ϙᴜʀᴀɴᴍᴇɴᴜ ғᴏʀ ɢᴇᴛᴛɪɴɢ ɴᴜᴍʙᴇʀ
  ◈ .ϙᴜʀᴀɴ [sᴜʀᴀʜ_ɴᴜᴍʙᴇʀ|sᴜʀᴀʜ_ɴᴀᴍᴇ]
  ╰──────────⳹

✦ ───『 *sᴛᴜᴅʏᴍᴇɴᴜ* 』─── ⚝
│✫ .ϙᴜʀᴀɴᴍᴇɴᴜ
│✫ .sᴜʀᴀʜ 36  
│✫ .ɢᴘᴛ
│✫ .ɢᴘᴛ2    
│✫ .ʙɪɴɢ  
│✫ .ʙᴀʀᴅ 
│✫ .ϙᴜᴏᴛᴇ  
│✫ .ᴀɪsᴇᴀʀᴄʜ 
│✫ .ᴅᴇғɪɴᴇ
│✫ .ᴇʟᴇᴍᴇɴᴛ
╰━━━━━━━━━━━━━━━━━━━━━━╯
  
  
  ✫ ───『 *Bᴏᴛ Mᴇɴᴜ* 』─── ✦
  ◈ .ᴘɪɴɢ
  ◈ .ʀᴜɴᴛɪᴍᴇ
  ◈ .sᴄʀɪᴘᴛ
  ◈ .sᴇʀᴠᴇʀ
  ◈ .ʙʟᴏᴄᴋʟɪsᴛ
  ◈ .ᴀʟɪᴠᴇ
  ◈ .ɪɴғᴏ
  ◈ .ᴏᴡɴᴇʀ
  ◈ .ᴛᴏᴛᴀʟғᴇᴀᴛᴜʀᴇ
  ◈ .ʟɪsᴛ
  ◈ .ᴄʀɪsᴛɪᴀɴᴏʀᴏɴᴀʟᴅᴏ
  ◈ .ᴄʀ7
  ◈ .ᴘᴘᴄᴏᴜᴘʟᴇ 
  ◈ .ᴘᴘᴄᴘ
  ◈ .ᴘɪɴᴛᴇʀᴇsᴛ
  ◈ .ᴍʏsɴ
  ╰━━━━━━━━━━━━━━━━━━━╯
  
  ✦ ───『 *ᴘʟᴜɢɪɴ* 』─── ⚝
  ◈ .ᴘʟᴜɢɪɴs
  ◈ .ɪɴsᴛᴀʟʟ <Gɪsᴛ URL>
  ╰──────────⳹`  
conn.sendFile(m.chat, pp, 'perfil.jpg', lkr, m, false, { mentions: [who] })
m.react('📃')
}
handler.help = ['allmenu']
handler.tags = ['main']
handler.command = ['allmenu', 'menu2'] 

export default handler
